ox_docs/corners/david/20200824224058-org_roam_intro.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-24 Fri 14:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Org Roam</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Taproot" />
<link rel="stylesheet" href="https://taproot3.sanity.gq/global.css" type="text/css"/>
<link rel="stylesheet" href="https://raw.githubusercontent.com/PrismJS/prism-themes/master/themes/prism-atom-dark.css" crossorigin="anonymous" referrerpolicy="no-referrer" />
</head>
<body>
<div id="preamble" class="status">
<div>Org Roam  Taproot 2021-09-24 Fri 13:59</div>
</div>
<div id="content">
<h1 class="title">Org Roam</h1>
<p>
:ROAM<sub>REFS</sub>: <a href="https://quantumish.github.io">https://quantumish.github.io</a>
</p>


<div id="outline-container-org85466c5" class="outline-2">
<h2 id="org85466c5"><span class="section-number-2">1</span> <span class="todo TODO">TODO</span> Philosophy</h2>
</div>
<div id="outline-container-org76756f4" class="outline-2">
<h2 id="org76756f4"><span class="section-number-2">2</span> Templates</h2>
<div class="outline-text-2" id="text-2">
<p>
Org Roam capture supports templates (although they are an abuse of the capture system).
</p>

<p>
Example config:
</p>
<div class="org-src-container">
<pre class="src src-elisp">("d" "default" plain (function org-roam--capture-get-point)
     "%?"
     :file-name "%&lt;%Y%m%d%H%M%S&gt;-${slug}"
     :head "#+title: ${title}\n"
     :unnarrowed t)
</pre>
</div>
<p>
Note that "d" ("default") is the default org roam will select, and parameters like <code>:file-name</code>, <code>:head</code> and <code>:unnarrowed</code> control the respective properties of the file.
</p>

<p>
More detailed config info can be found <a href="https://www.orgroam.com/manual/Org_002droam-Template-Expansion.html#Org_002droam-Template-Expansion">here</a>.
</p>
</div>
</div>

<div id="outline-container-org908cc3f" class="outline-2">
<h2 id="org908cc3f"><span class="section-number-2">3</span> References</h2>
<div class="outline-text-2" id="text-3">
<p>
Org Roam notes can contain references to websites or papers (via <a href="https://github.com/jkitchin/org-ref">org-ref</a>).
The methods to reference either type of source are shown below.
</p>
<pre class="example">
#+title: Google
#+roam_key: https://www.google.com/
</pre>
<pre class="example">
#+title: Neural Ordinary Differential Equations
#+roam_key: cite:chen18_neural_ordin_differ_equat
</pre>
</div>
</div>

<div id="outline-container-org560f509" class="outline-2">
<h2 id="org560f509"><span class="section-number-2">4</span> Misc Variables</h2>
<div class="outline-text-2" id="text-4">
<p>
The variable <code>org-roam-index-file</code> can be customized to allow proper usage of the <code>org-roam-jump-to-index</code> command.
</p>
</div>
</div>

<div id="outline-container-org5c53b15" class="outline-2">
<h2 id="org5c53b15"><span class="section-number-2">5</span> More Config</h2>
<div class="outline-text-2" id="text-5">
<p>
<code>(require 'org-roam-protocol)</code> is useful!
</p>
</div>
</div>
</div>
</body>
</html>
