firn_docs/corners/david/20200824224058-org_roam_intro.tex
% Created 2021-09-27 Mon 11:51
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\setlength{\parindent}{0pt}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{svg}
\usepackage{cancel}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\renewcommand{\tableofcontents}{}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Taproot}
\date{\today}
\title{Org Roam}
\hypersetup{
 pdfauthor={Taproot},
 pdftitle={Org Roam},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

:ROAM\textsubscript{REFS}: \url{https://quantumish.github.io}


\section{{\bfseries\sffamily TODO} Philosophy}
\label{sec:orge9c6499}
\section{Templates}
\label{sec:org5de1e74}
Org Roam capture supports templates (although they are an abuse of the capture system).

Example config:
\begin{verbatim}
("d" "default" plain (function org-roam--capture-get-point)
     "%?"
     :file-name "%<%Y%m%d%H%M%S>-${slug}"
     :head "#+title: ${title}\n"
     :unnarrowed t)
\end{verbatim}
Note that "d" ("default") is the default org roam will select, and parameters like \texttt{:file-name}, \texttt{:head} and \texttt{:unnarrowed} control the respective properties of the file.

More detailed config info can be found \href{https://www.orgroam.com/manual/Org\_002droam-Template-Expansion.html\#Org\_002droam-Template-Expansion}{here}.

\section{References}
\label{sec:orgcadeddd}
Org Roam notes can contain references to websites or papers (via \href{https://github.com/jkitchin/org-ref}{org-ref}).
The methods to reference either type of source are shown below.
\begin{verbatim}
#+title: Google
#+roam_key: https://www.google.com/
\end{verbatim}
\begin{verbatim}
#+title: Neural Ordinary Differential Equations
#+roam_key: cite:chen18_neural_ordin_differ_equat
\end{verbatim}

\section{Misc Variables}
\label{sec:org8f043de}
The variable \texttt{org-roam-index-file} can be customized to allow proper usage of the \texttt{org-roam-jump-to-index} command.

\section{More Config}
\label{sec:orgfe7205a}
\texttt{(require 'org-roam-protocol)} is useful!
\end{document}
